# Importing OS to be able to access my folder with multiple files

In [36]:
import os
import pandas as pd
file = os.listdir("Data")
print(file)

['chicago.csv', 'new_york_city.csv', 'washington.csv']

# reading multiple csv files as dataframes or dictionaries

In [28]:
city_data = { 'chicago': "C:/Users/User/Desktop/My_python_folder/Data/chicago.csv",
              'new_york_city': "C:/Users/User/Desktop/My_python_folder/Data/new_york_city.csv",
              'washington': "C:/Users/User/Desktop/My_python_folder/Data/washington.csv" }

# defining functions

In [31]:
# this can only take one city at a time
city = input("enter city: ").lower()
df = pd.read_csv(city_data[city])
df.head(3)

enter city: chicago

,Unnamed: 0,Start Time,End Time,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year
0,1423854,2017-06-23 15:09:32,2017-06-23 15:14:53,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0
1,955915,2017-05-25 18:19:03,2017-05-25 18:45:53,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0
2,9031,2017-01-04 08:27:49,2017-01-04 08:34:45,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0

In [86]:
def get_city_data():
    city = input("enter city: ").lower()
    df = pd.read_csv(city_data[city])
    return df


def clean_data(df):
    df[["Start_Date", "Start_Time"]] = df["Start Time"].str.split(" ", expand=True)
    df[["End_Date", "End_Time"]] = df["End Time"].str.split(" ", expand = True)
    df = df.drop(["Start Time", "End Time"], axis = 1)
    df["Start_Date"] = pd.to_datetime(df["Start_Date"])
    df["End_Date"] = pd.to_datetime(df["End_Date"])
    df["Day"] = df["Start_Date"].dt.day_name()
    df["Month"] = df["Start_Date"].dt.month_name()
    df["Year"] = df["Start_Date"].dt.year
    df.rename(columns = {"Unnamed: 0":"ID"}, inplace=True )
    return df
    
    
    
get_city = get_city_data()
clean_data = clean_data(get_city)
clean_data

enter city: chicago

,ID,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start_Date,Start_Time,End_Date,End_Time,Day,Month,Year
0,1423854,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,2017-06-23,15:09:32,2017-06-23,15:14:53,Friday,June,2017
1,955915,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0,2017-05-25,18:19:03,2017-05-25,18:45:53,Thursday,May,2017
2,9031,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,2017-01-04,08:27:49,2017-01-04,08:34:45,Wednesday,January,2017
3,304487,350,Christiana Ave & Lawrence Ave,St. Louis Ave & Balmoral Ave,Subscriber,Male,1986.0,2017-03-06,13:49:38,2017-03-06,13:55:28,Monday,March,2017
4,45207,534,Clark St & Randolph St,Desplaines St & Jackson Blvd,Subscriber,Male,1975.0,2017-01-17,14:53:07,2017-01-17,15:02:01,Tuesday,January,2017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
299995,64825,590,Orleans St & Elm St (*),Sheffield Ave & Webster Ave,Subscriber,Male,1965.0,2017-01-21,13:18:00,2017-01-21,13:27:50,Saturday,January,2017
299996,695993,1139,Ashland Ave & Blackhawk St,Clark St & Elm St,Customer,NaN,NaN,2017-04-28,19:32:19,2017-04-28,19:51:18,Friday,April,2017
299997,159685,1368,Ravenswood Ave & Lawrence Ave,Stockton Dr & Wrightwood Ave,Subscriber,Female,1988.0,2017-02-12,09:59:01,2017-02-12,10:21:49,Sunday,February,2017
299998,564681,705,Sheffield Ave & Willow St,Clark St & Chicago Ave,Customer,NaN,NaN,2017-04-16,17:07:15,2017-04-16,17:19:00,Sunday,April,2017
299999,1021247,1028,Wacker Dr & Washington St,Damen Ave & Division St,Subscriber,Male,1984.0,2017-05-30,12:38:28,2017-05-30,12:55:36,Tuesday,May,2017

# cleaning the three data frames but wrapping them in a function above

### splitting the start and end time to get dates, time in different columns using str.split() method

In [ ]:
# df[["Start_Date", "Start_Time"]] = df["Start Time"].str.split(" ", expand=True)
#     df[["End_Date", "End_Time"]] = df["End Time"].str.split(" ", expand = True)

### dropping the original start and end columns

In [ ]:
# df = df.drop(["Start Time", "End Time"], axis = 1)

# changing data types of the date and time from object or str using the pd.to_datetime() method

In [50]:
# df["Start_Date"] = pd.to_datetime(df["Start_Date"])
# df["End_Date"] = pd.to_datetime(df["End_Date"])

# clean_data["Start_Date"] = pd.to_datetime(clean_data["Start_Date"])
# clean_data["End_Date"] = pd.to_datetime(clean_data["End_Date"])
# clean_data.head(3)
# clean_data.info()

In [51]:
clean_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     3 non-null      int64
 1   Trip Duration  3 non-null      int64
 2   Start Station  3 non-null      object
 3   End Station    3 non-null      object
 4   User Type      3 non-null      object
 5   Gender         3 non-null      object
 6   Birth Year     3 non-null      float64
 7   Start_Date     3 non-null      datetime64[ns]
 8   Start_Time     3 non-null      object
 9   End_Date       3 non-null      datetime64[ns]
 10  End_Time       3 non-null      object
dtypes: datetime64[ns](2), float64(1), int64(2), object(6)
memory usage: 392.0+ bytes

# How to extract day name, month name and year using .dt.day_name, .dt.month_name and .dt.year from importing date

In [58]:
from datetime import date

In [ ]:
# clean_data["Start_Day"] = clean_data["Start_Date"].dt.day_name()
# clean_data["Start_Month"] = clean_data["Start_Date"].dt.month_name()
# clean_data["Start_Year"] = clean_data["Start_Date"].dt.year

In [66]:
clean_data

,Unnamed: 0,Trip Duration,Start Station,End Station,User Type,Gender,Birth Year,Start_Date,Start_Time,End_Date,End_Time,Day,Month,Year
0,1423854,321,Wood St & Hubbard St,Damen Ave & Chicago Ave,Subscriber,Male,1992.0,2017-06-23,15:09:32,2017-06-23,15:14:53,Friday,June,2017
1,955915,1610,Theater on the Lake,Sheffield Ave & Waveland Ave,Subscriber,Female,1992.0,2017-05-25,18:19:03,2017-05-25,18:45:53,Thursday,May,2017
2,9031,416,May St & Taylor St,Wood St & Taylor St,Subscriber,Male,1981.0,2017-01-04,08:27:49,2017-01-04,08:34:45,Wednesday,January,2017

# Renaming column using the .rename() method

In [81]:
#clean_data.columns

In [82]:
# clean_data.rename(columns = {"Unnamed: 0":"ID"}, inplace=True )
# clean_data

In [88]:
import matplotlib.pyplot as plt

# Analysing the dataframe above using the following questions and visualizing it using matplotlib

### display the most common month

In [87]:
clean_data.Month.value_counts()

June        98081
May         66755
April       51659
February    32057
March       29639
January     21809
Name: Month, dtype: int64